app/serializers/adopter_serializer.rb

  def meetings
    self.object.meetings.map do |meeting|
---
SELECT "meetings".* FROM "meetings" WHERE "meetings"."adopter_id" = $1  [["adopter_id", 29]]